#pragma once

#include <iostream>
#include <vector>
using namespace std;

////////////////////////////////////////////////////////////Натуральные числа////////////////////////////////////////////////////////////

int NZER_N_B (vector<int> a); // Проверка на ноль: если число не равно нулю, то «да» иначе «нет» //Старосельский Александр 

vector<int> ADD_1N_N(vector<int> input);  // Добавление 1 к натуральному числу //Михаил Киришский

vector<int>  SUB_NN_N(vector<int> a, vector<int> b);  // Вычитание из первого большего натурального числа второго меньшего или равного // Ермольев Максим Викторович

int COM_NN_D(vector<int> num1, vector<int> num2); //Сравнение натуральных чисел: 2 - если первое больше второго, 0, если равно, 1 иначе. // Астахов Михаил

////////////////////////////////////////////////////////////Натуральные числа////////////////////////////////////////////////////////////




////////////////////////////////////////////////////////////Целые числа////////////////////////////////////////////////////////////
int ABS_Z_N(int sign);  // Абсолютная величина числа, результат - натуральное //Старосельский Александр