#pragma once

#include <iostream>
#include <vector>
using namespace std;

////////////////////////////////////////////////////////////Натуральные числа////////////////////////////////////////////////////////////

int NZER_N_B(vector<int> a);  // Проверка на ноль: если число не равно нулю, то «да» иначе «нет» //Старосельский Александр 

vector<int> ADD_1N_N(vector<int> input);  // Добавление 1 к натуральному числу //Михаил Киришский

vector <int>MUL_Nk_N(vector<int> N, vector<int> k); //Умножить натуральное число на 10^k // Чиганов Даниил город Санкт-Петербург страна Россия район Невский Первый парень на деревне Мамин программист Поглатитель бабушкиных пирожков пошел нахуй пидор
vector <int>SUB_NDN_N(vector<int> a, vector<int> b, vector<int> k); //Вычитание из натурального другого натурального, умноженного на цифру для случая с неотрицательным результатом

vector<int>  SUB_NN_N(vector<int> a, vector<int> b);  // Вычитание из первого большего натурального числа второго меньшего или равного // Ермольев Максим Викторович

int COM_NN_D(vector<int> num1, vector<int> num2); //Сравнение натуральных чисел: 2 - если первое больше второго, 0, если равно, 1 иначе. // Астахов Михаил

////////////////////////////////////////////////////////////Натуральные числа////////////////////////////////////////////////////////////
//
//
//
//
//
////////////////////////////////////////////////////////////Целые числа////////////////////////////////////////////////////////////

vector<int> ABS_Z_N(vector<int> a);  // Абсолютная величина числа, результат - натуральное //Старосельский Александр


vector<int> MUL_ND_N(vector<int> entry, int number); //Умножение целого на цифру //Игорян

vector<int> MUL_ZM_Z(vector<int> input); //Умножение целого числа на -1 //Табояков Иван
